Revit 2026 API

# HermiteSurfaceCreate(Int32, Int32, IListXYZ, Boolean, Boolean) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static HermiteSurface Create(
	int nU,
	int nV,
	IList<XYZ> points,
	bool periodicU,
	bool periodicV
)
```
```vb
Public Shared Function Create (
	nU As Integer,
	nV As Integer,
	points As IList(Of XYZ),
	periodicU As Boolean,
	periodicV As Boolean
) As HermiteSurface
```
```cpp
public:
static HermiteSurface^ Create(
	int nU,
	int nV,
	IList<XYZ^>^ points,
	bool periodicU,
	bool periodicV
)
```
```fsharp
static member Create :
        nU : int *
        nV : int *
        points : IList<XYZ> *
        periodicU : bool *
        periodicV : bool -> HermiteSurface
```

#### Parameters

nU Int32

nV Int32

points IListXYZ

periodicU Boolean

periodicV Boolean

#### Return Value

HermiteSurface

#### Reference

HermiteSurface Class

Create Overload

Autodesk.Revit.DB Namespace